
tap 'caskroom/cask'

# Core Homebrew
brew 'ack'
brew 'adns'
brew 'asciinema'
brew 'aspell'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'bison'
brew 'byobu'
brew 'cairo'
brew 'cmake'
brew 'cmatrix'
brew 'coreutils'
brew 'cracklib'
brew 'cscope'
brew 'ctags'
brew 'ctop'
brew 'detox'
brew 'dive'
brew 'dnsmasq'
brew 'docker-completion'
brew 'docutils'
brew 'e2fsprogs'
brew 'emacs'
brew 'erlang@20'
brew 'fd'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'ghostscript'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gopass'
brew 'graphite2'
brew 'grep'
brew 'harfbuzz'
brew 'htop'
brew 'hugo'
brew 'icu4c'
brew 'ideviceinstaller'
brew 'ilmbase'
brew 'imagemagick'
brew 'imagemagick@6'
brew 'ios-deploy'
brew 'isl'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'krb5'
brew 'kwm'
brew 'libassuan'
brew 'libcroco'
brew 'libde265'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libheif'
brew 'libidn2'
brew 'libimobiledevice'
brew 'libksba'
brew 'libmpc'
brew 'libomp'
brew 'libplist'
brew 'libpng'
brew 'libpq'
brew 'librsvg'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libusbmuxd'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lsd'
brew 'lua'
brew 'luajit'
brew 'lz4'
brew 'lzo'
brew 'markdown'
brew 'mpfr'
brew 'msgpack'
brew 'ncurses'
brew 'neofetch'
brew 'neovim'
brew 'nettle'
brew 'newt'
brew 'nginx'
brew 'nmap'
brew 'nnn'
brew 'node'
brew 'node@12'
brew 'npth'
brew 'oniguruma'
brew 'openexr'
brew 'openjpeg'
brew 'openldap'
brew 'openssl'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'pacvim'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pgbadger'
brew 'pinentry'
brew 'pipenv'
brew 'pixman'
brew 'pkcs11-helper'
brew 'pkg-config'
brew 'popt'
brew 'postgresql'
brew 'postgresql-common'
brew 'postgresql@10'
brew 'postgresql@11'
brew 'postgresql@12'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'python@2'
brew 'python@3.8'
brew 'ragel'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby'
brew 'ruby-build'
brew 's-lang'
brew 'screenresolution'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'skhd'
brew 'smartmontools'
brew 'socat'
brew 'speedtest-cli'
brew 'sqlite'
brew 'tcl-tk'
brew 'telnet'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unbound'
brew 'unibilium'
brew 'unoconv'
brew 'unrar'
brew 'usbmuxd'
brew 'utf8proc'
brew 'vim'
brew 'webp'
brew 'wget'
brew 'wxmac'
brew 'x265'
brew 'xmlstarlet'
brew 'xz'
brew 'yabai'
brew 'yadm'
brew 'yaws'
brew 'zlib'
brew 'zsh'

# Cask Apps
cask 'alacritty'
cask 'alfred'
cask 'brave-browser'
cask 'captin'
cask 'dbngin'
cask 'diffmerge'
cask 'dozer'
cask 'edex-ui'
cask 'font-source-code-pro'
cask 'fork'
cask 'gitup'
cask 'java'
cask 'karabiner-elements'
cask 'katana'
cask 'keycastr'
cask 'kitty'
cask 'licecap'
cask 'miniconda'
cask 'ngrok'
cask 'notion'
cask 'obs'
cask 'openkey'
cask 'pycharm-ce'
cask 'sloth'
cask 'steam'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'whatsapp'
cask 'wkhtmltopdf'

